Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation
Provides the same interface as Api.Automation.NavisworksApplication but within the current process.
Calls made via NavisworksApplication or command line when automating eventually call methods
on here.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.AddPluginAssembly(System.String)
Adds another assembly that plugins can be loaded from.
Assembly is loaded using the LoadFrom context and can be used outside the Application root.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.AppendFile(System.String)
Appends the Navisworks supported file to the currently loaded document
fileName: The file name including extension
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to append file

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.CreateCache(System.String)
Creates a corresponding nwc file for specified file.
fileNameToCache: The file name, excluding extension, for the cache file

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.DisableProgress
Normal behavior is that Progress is displayed when performing long operations, even during Automated actions.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.EnableProgress
Normal behavior is that Progress is displayed when performing long operations, even during Automated actions.

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.ExecuteAddInPlugin(System.String,System.String[])
Executes an Addin Plugin whose full name is given by pluginId, passing in the paramaters given.
pluginId:  The full identifier for the plugin.
This is formed as Name.DeveloperId
parameters: Optional parameters to pass to the plugin
Throws System.InvalidOperationException:
Plugin not found, failed to load or is not an AddInPlugin

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.GenerateThumbnail(System.Int32,System.Int32,System.String)
Generates a Thumbnail Image for this Document, and save it as a PNG image
width: The width of the image
height: The height of the image
fileName: The file name of the saved image
Throws System.InvalidOperationException:
Fail to generate the thumbnail

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.GenerateThumbnailByRayTrace(System.Int32,System.Int32,System.String)
Generates a thumbnail render by ray trace for this Document, and save it as a PNG image
width: The width of the image
height: The height of the image
fileName: The file name of the saved image
Throws System.InvalidOperationException:
Fail to generate the thumbnail

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.OpenFile(System.String,System.String[])
Loads one or more Navisworks supported files
fileName: First file to open
moreFiles: Other files to open
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to open file

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.Print
Sends the current View to the Printer

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.Print(System.String)
Sends the current View to the Printer
printer: The name of the printer to print to

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.Print(System.String,System.String)
Sends the current View to the Printer
printer: The name of the printer to print to
driver: The name of the printer driver to use

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.Print(System.String,System.String,System.String)
Sends the current View to the Printer
printer: The name of the printer to print to
driver: The name of the printer driver to use
port: The name of the port the printer is connected to

Autodesk.Navisworks.Api.ApplicationParts.ApplicationAutomation.SaveFile(System.String)
Save the documents loaded using OpenFile to a single Navisworks Document
fileName: The file name including extension
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to save file